app/controllers/admin/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "is_published", "slug", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = Post.new(params[:post])

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "title" = 'Lots O'' Cats', "is_published" = 't', "slug" = 'lots-o-cats', "updated_at" = '2013-07-17 18:19:58.292464' WHERE "posts"."id" = 2
---
  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    post = Post.find(params[:id])
    post.destroy